NikolayBobovnikov/ircapture/auvir_embed/mocap/receiver/stm32f103/Src/se8r01_rx_tx_2Mps.c
//this is a copy and paste job made by F2k

#include "stm32f1xx_hal.h"
#include "se8r01.h"

///
/// on initialization se8r01 check http://forum.easyelectronics.ru/viewtopic.php?f=9&t=21484
///

extern SPI_HandleTypeDef hspi1;
extern char mode;      //r=rx, t=tx
void delay_us(uint8_t us);
void nrf24_setup_gpio();
uint8_t gtemp[5];

// Define a static TX address
extern uint8_t TX_ADDRESS[TX_ADR_WIDTH];
extern uint8_t rx_buf[TX_PLOAD_WIDTH]; // initialize value
extern uint8_t tx_buf[TX_PLOAD_WIDTH];




uint8_t payload_len;

void nrf24_init()
{
    nrf24_setup_gpio();
    nrf24_ce_set(LOW);
    nrf24_csn_set(HIGH);
}

void nrf24_config(uint8_t channel, uint8_t pay_length)
{
    // Use static payload length ... //
    payload_len = pay_length;

    // Set RF channel
    nrf24_write_register(RF_CH,channel);

    // Set length of incoming payload
    nrf24_write_register(RX_PW_P0, payload_len); // Auto-ACK pipe ...
    nrf24_write_register(RX_PW_P1, 0x00); // Data payload pipe
    nrf24_write_register(RX_PW_P2, 0x00); // Pipe not used
    nrf24_write_register(RX_PW_P3, 0x00); // Pipe not used
    nrf24_write_register(RX_PW_P4, 0x00); // Pipe not used
    nrf24_write_register(RX_PW_P5, 0x00); // Pipe not used

    // 1 Mbps, TX gain: 0dbm
    nrf24_write_register(RF_SETUP, (0<<RF_DR_HIGH)|((0x03)<<RF_PWR));

    // CRC, number of bytes CRC length
    nrf24_write_register(CONFIG,((1<<EN_CRC)|(0<<CRCO)));

    // Auto Acknowledgment
    nrf24_write_register(EN_AA,(0<<ENAA_P0)|(0<<ENAA_P1)|(0<<ENAA_P2)|(0<<ENAA_P3)|(0<<ENAA_P4)|(0<<ENAA_P5));

    // Enable RX addresses
    nrf24_write_register(EN_RXADDR,(1<<ERX_P0)|(0<<ERX_P1)|(0<<ERX_P2)|(0<<ERX_P3)|(0<<ERX_P4)|(0<<ERX_P5));

    // Auto retransmit delay: 1000 us and Up to 15 retransmit trials
    nrf24_write_register(SETUP_RETR,(0x04<<ARD)|(0x0F<<ARC));

    // Dynamic length configurations: No dynamic length
    nrf24_write_register(DYNPD,(0<<DPL_P0)|(0<<DPL_P1)|(0<<DPL_P2)|(0<<DPL_P3)|(0<<DPL_P4)|(0<<DPL_P5));

    // Start listening
    nrf24_powerUpRx();
}

void nrf24_config_rx(uint8_t *pipe_addr, uint8_t channel, uint8_t pay_length)
{
    // setup addresses for pipe
    nrf24_write_register_multi(RX_ADDR_P1, pipe_addr, TX_ADR_WIDTH);

    // Use static payload length ... //
    payload_len = pay_length;

    // Set RF channel
    nrf24_write_register(RF_CH,channel);

    // Set length of incoming payload
    nrf24_write_register(RX_PW_P0, 0x00); // Auto-ACK pipe ...
    nrf24_write_register(RX_PW_P1, payload_len); // Data payload pipe
    nrf24_write_register(RX_PW_P2, 0x00); // Pipe not used
    nrf24_write_register(RX_PW_P3, 0x00); // Pipe not used
    nrf24_write_register(RX_PW_P4, 0x00); // Pipe not used
    nrf24_write_register(RX_PW_P5, 0x00); // Pipe not used

    // 1 Mbps, TX gain: 0dbm
    nrf24_write_register(RF_SETUP, (0<<RF_DR_HIGH)|((0x03)<<RF_PWR));

    //                          (CRC enabled,  1 byte)
    nrf24_write_register(CONFIG,(1<<EN_CRC) | (0<<CRCO));

    // Auto Acknowledgment
    nrf24_write_register(EN_AA,(0<<ENAA_P0)|(0<<ENAA_P1)|(0<<ENAA_P2)|(0<<ENAA_P3)|(0<<ENAA_P4)|(0<<ENAA_P5));

    // Enable RX addresses
    nrf24_write_register(EN_RXADDR,(0<<ERX_P0)|(1<<ERX_P1)|(0<<ERX_P2)|(0<<ERX_P3)|(0<<ERX_P4)|(0<<ERX_P5));

    // Auto retransmit delay: 1000 us and Up to 15 retransmit trials
    nrf24_write_register(SETUP_RETR,(0x04<<ARD)|(0x0F<<ARC));

    // Dynamic length configurations: No dynamic length
    nrf24_write_register(DYNPD,(0<<DPL_P0)|(0<<DPL_P1)|(0<<DPL_P2)|(0<<DPL_P3)|(0<<DPL_P4)|(0<<DPL_P5));

    // Start listening
    nrf24_powerUpRx();
}

void nrf24_config_tx(uint8_t *pipe_addr, uint8_t channel, uint8_t pay_length)
{
    // setup addresses for pipes
    //nrf24_write_register_multi(RX_ADDR_P0, pipe_addr, nrf24_ADDR_LEN);
    nrf24_write_register_multi(TX_ADDR, pipe_addr, TX_ADR_WIDTH);

    // Use static payload length ... //
    payload_len = pay_length;

    // Set RF channel
    nrf24_write_register(RF_CH,channel);

    // Set length of incoming payload
    nrf24_write_register(RX_PW_P0, 0x00); // Auto-ACK pipe ...
    nrf24_write_register(RX_PW_P1, 0x00); // Data payload pipe
    nrf24_write_register(RX_PW_P2, 0x00); // Pipe not used
    nrf24_write_register(RX_PW_P3, 0x00); // Pipe not used
    nrf24_write_register(RX_PW_P4, 0x00); // Pipe not used
    nrf24_write_register(RX_PW_P5, 0x00); // Pipe not used

    // 1 Mbps, TX gain: 0dbm
    nrf24_write_register(RF_SETUP, (0<<RF_DR_HIGH)|((0x03)<<RF_PWR));

    //                          (CRC enabled,  1 byte)
    nrf24_write_register(CONFIG,(1<<EN_CRC) | (0<<CRCO));

    // Auto Acknowledgment
    nrf24_write_register(EN_AA,(0<<ENAA_P0)|(0<<ENAA_P1)|(0<<ENAA_P2)|(0<<ENAA_P3)|(0<<ENAA_P4)|(0<<ENAA_P5));

    // Enable RX addresses
    nrf24_write_register(EN_RXADDR,(0<<ERX_P0)|(0<<ERX_P1)|(0<<ERX_P2)|(0<<ERX_P3)|(0<<ERX_P4)|(0<<ERX_P5));

    // Auto retransmit delay: 1000 us and Up to 15 retransmit trials
    nrf24_write_register(SETUP_RETR,(0x04<<ARD)|(0x0F<<ARC));

    // Dynamic length configurations: No dynamic length
    nrf24_write_register(DYNPD,(0<<DPL_P0)|(0<<DPL_P1)|(0<<DPL_P2)|(0<<DPL_P3)|(0<<DPL_P4)|(0<<DPL_P5));

    // Start listening
    nrf24_powerUpTx();
}

void nrf24_set_rx_address(uint8_t * adr)
{
    //nrf24_ce_set(LOW);
    nrf24_write_register_multi(RX_ADDR_P0,adr,TX_ADR_WIDTH);
    //nrf24_ce_set(HIGH);
}

void nrf24_set_tx_address(uint8_t* adr)
{
    // RX_ADDR_P0 must be set to the sending addr for auto ack to work. //
   nrf24_write_register_multi(RX_ADDR_P0, adr, TX_ADR_WIDTH);
   nrf24_write_register_multi(TX_ADDR, adr, TX_ADR_WIDTH);
}

uint8_t nrf24_get_payload_len()
{
    return payload_len;
}

uint8_t nrf24_get_rx_fifo_pending_data_length()
{
    uint8_t status;
    nrf24_csn_set(LOW);
    nrf24_spi_transaction(R_RX_PL_WID);
    status = nrf24_spi_transaction(0x00);
    nrf24_csn_set(HIGH);
    return status;
}

bool nrf24_is_data_ready()
{
    // See note in getData() function - just checking RX_DR isn't good enough
    uint8_t status = nrf24_get_status_register();

